Repository: jonasswiatek/Strokes
Catalog: source/Strokes.BasicAchievements/Properties/AchievementResources.*.resx
Languages: ru_ru

# TooManyModifiersMethodDeclarationAchievementName
source: Modifier addict
ru_ru: Любитель модификаторов

# TooManyModifiersMethodDeclarationAchievementDescription
source: Declare a method with lots of modifiers
ru_ru: Объявите метод с большим количеством модификаторов

# InstantiateObjectAchievementName
source: Objectify!
ru_ru: Воплотись!

# InstantiateObjectAchievementDescription
source: Create an object
ru_ru: Создайте объект

# IComparableAchievementDescription
source: Write a class that implements IComparable
ru_ru: Напишите класс, реализующий интерфейс IComparable

# IfStatementAchievementName
source: What if...
ru_ru: А что если...

# IfStatementAchievementDescription
source: Make use of an if statement
ru_ru: Используйте оператор if

# HelloWorldAchievementDescription
source: Write the most-writen program ever
ru_ru: Напишите саму часто создаваемую программу

# TryCatchRethrowStatementAchievementName
source: Operation:Activate umbrella
ru_ru: Операция:Открывание зонтика

# TryCatchRethrowStatementAchievementDescription
source: Write a catch statement that simply rethrows the exception
ru_ru: Напишите оператор catch которй просто пробрасывает исключение

# ArrayLengthPropertyAchievementName
source: Array length
ru_ru: Длина массива

# ArrayLengthPropertyAchievementDescription
source: Use the Length property of an array
ru_ru: Используйте свойство Length у массива

# LambdaExpressionAchievementName
source: Lambda Expression
ru_ru: Lambda-выражение

# LambdaExpressionAchievementDescription
source: Use a lambda expression
ru_ru: Используйте lambda-выражение

# DeclareInitializeCharName
source: Declare and initialize a char
ru_ru: Объявление и инициализация переменной типа char

# DeclareInitializeCharDescription
source: Declare and initialize a char in one statement
ru_ru: Одним оператором объявите и проинициализируйте переменную типа char

# UpperBoundaryValueCharName
source: Living on the char edge
ru_ru: Жизнь на символической грани

# UpperBoundaryValueCharDescription
source: Assign the maximal allowed value to a char (beware the overflow!)
ru_ru: Присвойте максимальное допустимое значение переменной типа char (бойтесь переполнения!)

# LowerBoundaryValueCharName
source: Living on the negative char edge
ru_ru: Жизнь на отрицательной символической грани

# LowerBoundaryValueCharDescription
source: Assign the minimal allowed value to a char (beware the overflow!)
ru_ru: Присвойте минимальное допустимое значение переменной типа char (бойтесь переполнения!)

# CreateMethodMultipleParametersAchievementName
source: Method man and the Wu-Tang Clan
ru_ru: Method Man и Wu-Tang Clan

# CreateMethodMultipleParametersAchievementDescription
source: Create a method with 2 or more parameters
ru_ru: Создайте метод с двумя или более параметрами

# CreateMethodOneParameterAchievementName
source: Method man and a friend
ru_ru: Method man с другом

# CreateMethodOneParameterAchievementDescription
source: Create a method with 1 parameter
ru_ru: Создайте метод с одним параметром

# BlockCommentAchievementName
source: Block comment
ru_ru: Блочный комментарий

# BlockCommentAchievementDescription
source: Write a block comment
ru_ru: Напишите блочный комментарий

# OverrideEqualsAchievementName
source: Define equality
ru_ru: Что такое равенство

# OverrideEqualsAchievementDescription
source: Override System.Object.Equals
ru_ru: Переопределите метод System.Object.Equals

# CaesarChallengeName
source: Caesar
ru_ru: Цезарь

# CaesarChallengeDescription
source: Write a Caesar encryption/decryption module
ru_ru: Напишите модуль, реализующий шифр Цезаря

# TryFinallyStatementAchievementName
source: Try-Finally Statement
ru_ru: Ключевые слова Try-Finally

# TryFinallyStatementAchievementDescription
source: Use the a try-finally without a catch statement.
ru_ru: Используйте ключевые слова try-finally без ключевого слова catch.

# ForAchievementName
source: For loop
ru_ru: Цикл for

# ForAchievementDescription
source: Use a for loop
ru_ru: Используйте цикл for

# UseConsoleReadlineAchievementName
source: Use Console.ReadLine()
ru_ru: Использование Console.ReadLine()

# UseConsoleReadlineAchievementDescription
source: Get input from the user
ru_ru: Получите ввод от пользователя

# IfCompoundExpressionAchievementName
source: Use compound expression in if statement
ru_ru: Используйте составное выражение в операторе if

# IfCompoundExpressionAchievementDescription
source: Make use of multiple expression in one if statement (usage of &&,||, etc. operators)
ru_ru: Используйте несколько выражений в одном операторе if (используйте операторы &&, ||, и т.д.)

# UpperBoundaryValueFloatName
source: Living on the floating edge
ru_ru: Жизнь на плавающей грани

# UpperBoundaryValueFloatDescription
source: Assign the maximal allowed value to a float (beware the overflow!)
ru_ru: Присвойте максимальное допустимое значение переменной типа float (бойтесь переполнения!)

# LowerBoundaryValueFloatName
source: Living on the negative floating edge
ru_ru: Жизнь на отрицательной плавающей грани

# LowerBoundaryValueFloatDescription
source: Assign the minimal allowed value to a float (beware the overflow!)
ru_ru: Присвойте минимальное допустимое значение переменной типа float (бойтесь переполнения!)

# UseIsKeywordAchievementName
source: Is
ru_ru: Есть

# UseIsKeywordAchievementDescription
source: Create an expression with the IS keyword
ru_ru: Создайте выражение с использованием ключевого слова IS

# AbstractClassAchievementName
source: Abstract class
ru_ru: Абстрактный класс

# AbstractClassAchievementDescription
source: Create an abstract class
ru_ru: Создайте абстрактный класс

# AbstractMethodAchievementName
source: Abstract method
ru_ru: Абстрактный метод

# AbstractMethodAchievementDescription
source: Create an abstract method
ru_ru: Создайте абстрактный метод

# UsingStatementAchievementName
source: Using statement
ru_ru: Оператор using

# UsingStatementAchievementDescription
source: Use the using-statement
ru_ru: Используйте оператор using

# MultipleDeclareIntName
source: Declare multiple integers in one statement
ru_ru: Объявите несколько целых переменных в одном операторе

# MultipleDeclareIntDescription
source: Declare multiple integers in one go
ru_ru: Объявите несколько целых переменных за раз

# RefParameterAchievementName
source: Ref Parameter
ru_ru: Параметр ref

# RefParameterAchievementDescription
source: Write a method that uses the ref keyword in its arguments
ru_ru: Напишите метод, использующий в одном из своих аргументов ключевое слово ref

# ArrayClearMethodAchievementName
source: Clear an Augean array
ru_ru: Очистка авгиевых массивов

# ArrayClearMethodAchievementDescription
source: Use the Array.Clear method to Clear an array
ru_ru: Используйте метод Array.Clear чтобы очистить массив

# ArrayIndexOfMethodAchievementName
source: IndexOf an array
ru_ru: Поиск индекса

# ArrayIndexOfMethodAchievementDescription
source: Use the Array.IndexOf method to IndexOf an array
ru_ru: Используйте метод массива Array.IndexOf

# ArrayReverseMethodAchievementName
source: Reverse an array
ru_ru: Переворот массива

# ArrayReverseMethodAchievementDescription
source: Use the Array.Reverse method to Reverse an array
ru_ru: Используйте метод Array.Reverse чтобы перевернуть содержимое массива

# ArraySortMethodAchievementName
source: Sort an array
ru_ru: Сортировка массива

# ArraySortMethodAchievementDescription
source: Use the Array.Sort method to sort an array
ru_ru: Используйте метод Array.Sort чтобы отсортировать массив

# PrintWithPlaceholdersFieldSizeAchievementName
source: Use placeholders and field size when writing to the screen
ru_ru: При выводе текста на экран используйте заполнители и указание размера выводимого поля

# PrintWithPlaceholdersFieldSizeAchievementDescription
source: Print something to the console using placeholders and explicit field sizes
ru_ru: Выведите что-нибудь на консоль с использованием заполнителей и явных указаний размеров полей

# VirtualMethodAchievementName
source: Virtual Reality
ru_ru: Виртуальная реальность

# VirtualMethodAchievementDescription
source: Create a virtual method
ru_ru: Создайте виртуальный метод

# OVerrideMethodAchievementName
source: Override!
ru_ru: Перекрыть!

# OVerrideMethodAchievementDescription
source: Override a method
ru_ru: Переопределите метод

# QueryExpressionAchievementName
source: Query Expression
ru_ru: Запросное выражение

# QueryExpressionAchievementDescription
source: Use a query expression
ru_ru: Используйте запросное выражение

# ForEachAchievementName
source: Foreach loop
ru_ru: Цикл foreach

# ForEachAchievementDescription
source: Use a foreach loop
ru_ru: Используйте цикл foreach

# DeclareInitializeDoubleName
source: Declare and initialize a double
ru_ru: Объявление и инициализация переменной типа double

# DeclareInitializeDoubleDescription
source: Declare and initialize a double in one statement
ru_ru: В одном операторе объявите и проинициализируйте переменную типа double

# PrintWithPlaceholdersAchievementName
source: Print with placeholders
ru_ru: Печать с заполнителями

# PrintWithPlaceholdersAchievementDescription
source: Print something to the console using placeholders
ru_ru: Выведите что-нибудь на консоль, используя заполнители

# ElseIfStatementAchievementName
source: Use else if statement
ru_ru: Использование оператора else if

# ElseIfStatementAchievementDescription
source: Make use of an else if statement
ru_ru: Найдите применение оператору else if

# CreateSingleLineMethodAchievementName
source: That's tiny
ru_ru: Какой маленький

# CreateSingleLineMethodAchievementDescription
source: Create a method that only contains one single return expression
ru_ru: Создайте метод, содержащий только одно единственное return-выражение

# AnonymousObjectAchievementName
source: Anonymous Object
ru_ru: Анонимный объект

# AnonymousObjectAchievementDescription
source: Create an anonymous object
ru_ru: Создайте анонимный объект

# TryCatchStatementAchievementName
source: Try-Catch Statement
ru_ru: Блок Try-Catch

# TryCatchStatementAchievementDescription
source: Use a try-catch statement
ru_ru: Используйте блок try-catch

# SwitchAchievementName
source: Multiplexing
ru_ru: Мультиплексирование

# SwitchAchievementDescription
source: Create a switch statement
ru_ru: Создайте оператор switch

# CreateBaseConstructorInitAchievementName
source: Call base
ru_ru: Звонок на базу

# CreateBaseConstructorInitAchievementDescription
source: Call another base constructor using the base() keyword from a constructor
ru_ru: Из конструктора вызовите конструктор базового класса с помощью ключевого слова base()

# CastAchievementName
source: Swords to plowshares
ru_ru: Мечи на орала

# CastAchievementDescription
source: Cast a variable explicitely
ru_ru: Явно приведите переменную

# DeclareMultipleDimArrayAchievementName
source: Declare a multidimensional array
ru_ru: Объявление многомерного массива

# DeclareMultipleDimArrayAchievementDescription
source: Declare a multidimensional array
ru_ru: Объявите многомерный массив

# CurseAlotAchievementDescription
source: Declare more than 5 variables that have a 'bad word' identifier
ru_ru: Объявите более пяти переменных, имена которых содержат 'нехорошие слова' (английские)

# CurseAlotAchievementName
source: How rude...
ru_ru: Как некультурно!

# SpeechlessAchievementDescription
source: Declare more than 5 variables that have very boring identifiers like 'meh', 'bla', etc.
ru_ru: Объявите более пяти переменных, имена которых очень скучны и ничего не обозначают, например 'meh', 'bla', и т.д.

# SpeechlessAchievementName
source: How original...
ru_ru: Как оригинально...

# DangerousEqualityCheckAchievementName
source: Double Trouble
ru_ru: Двойная проблема

# DangerousEqualityCheckAchievementDescription
source: Check for equality between floating point numbers (hint: this could fail)
ru_ru: Проверьте равенство двух чисел с плавающей точкой (хинт: это может не сработать)

# CreateDelegateAchievementDescription
source: Declare a delegate
ru_ru: Объявите делегат delegate

# CreateDelegateAchievementName
source: Nothing is impossible if you can delegate
ru_ru: Нет ничего невозможного, если поручить это другому

# CreateEventAchievementDescription
source: Create an event
ru_ru: Создайте событие

# CreateEventAchievementName
source: Event of the year?!
ru_ru: Событие года?!

# AbortThreadAchievementDescription
source: Abort a thread using Abort()
ru_ru: Прервите поток с помощью метода Abort()

# AbortThreadAchievementName
source: Abort, abort, abort!
ru_ru: Отмена, отмена, отмена!

# CreateThreadAchievementDescription
source: Create a thread
ru_ru: Создайте поток

# CreateThreadAchievementName
source: Weaver
ru_ru: Паук

# JoinThreadAchievementDescription
source: Block a running thread using Join()
ru_ru: Заблокируйте текущий поток с помощью метода Join()

# JoinThreadAchievementName
source: Block that thread!
ru_ru: Остановить этот поток!

# SleepThreadAchievementDescription
source: Suspends a thread for a specified time.
ru_ru: Приостановите поток на какое-то явно указанное время.

# SleepThreadAchievementName
source: Nighty night.
ru_ru: Спокойной ночи.

# StartThreadAchievementDescription
source: Start a thread
ru_ru: Запустите поток

# StartThreadAchievementName
source: Ready, thread...start!
ru_ru: Внимание, поток... старт!
