Repository: jonasswiatek/Strokes
Catalog: source/Strokes.BasicAchievements/Properties/AchievementResources.*.resx
Languages: ru_ru

# UpperBoundaryValueIntName
source: Living on the edge
ru_ru: Жизнь на грани

# UpperBoundaryValueIntDescription
source: Assign the maximal allowed value to an integer (beware the overflow!)
ru_ru: Присвойте максимальное допустимое значение переменной целого типа (бойтесь переполнения!)

# LowerBoundaryValueIntName
source: Living on the negative edge
ru_ru: Жизнь на отрицательной грани

# LowerBoundaryValueIntDescription
source: Assign the minimal allowed value to an integer (beware the overflow!)
ru_ru: Присвойте минимальное допустимое значение переменной целого типа (бойтесь переполнения!)

# MultipleDeclareCharName
source: Declare multiple chars in one statement
ru_ru: Объявление нескольких символьных переменных в одном операторе

# MultipleDeclareCharDescription
source: Declare multiple chars in one go
ru_ru: Объявите несколько символьных переменных за раз

# OverrideGetHashCodeAchievementName
source: ID object
ru_ru: Предъявите ваши документы

# OverrideGetHashCodeAchievementDescription
source: Override System.Object.GetHashCode() method
ru_ru: Переопределите метод System.Object.GetHashCode()

# DoWhileLoopAchievementName
source: DoWhile loop
ru_ru: Цикл DoWhile

# DoWhileLoopAchievementDescription
source: Use a do-while loop
ru_ru: Используйте цикл do-while

# InfiniteWhileLoopAchievementName
source: Infinite while loop
ru_ru: Бесконечный цикл while

# InfiniteWhileLoopAchievementDescription
source: Create an infinite while-loop
ru_ru: Создайте бесконечный цикл while

# CreateMethodAchievementName
source: Method man
ru_ru: Спец по методам

# CreateMethodAchievementDescription
source: Create a method
ru_ru: Создайте метод

# ConstKeywordAchievementName
source: Create a constant
ru_ru: Создание константы

# ConstKeywordAchievementDescription
source: Use the const keyword
ru_ru: Используйте ключевое слово const

# InstantiateObjectWithInitAchievementName
source: Create object with initializers
ru_ru: Создание объекта с помощью инициализатора

# InstantiateObjectWithInitAchievementDescription
source: Create an object using object initializer notation
ru_ru: Создайте объект, используя синтаксис инициализаторов объектов

# TryCatchFinallyStatementAchievementName
source: Try-Catch-Finally Statement
ru_ru: Блок Try-Catch-Finally

# TryCatchFinallyStatementAchievementDescription
source: Use a try-catch-finally statement
ru_ru: Используйте блок try-catch-finally

# CreateAutoPropertyAchievementDescription
source: Create an auto property
ru_ru: Создайте автоматическое свойство

# CreateMethodReturnVoidAchievementName
source: Into the void
ru_ru: В пустоту

# CreateMethodReturnVoidAchievementDescription
source: Create a method that returns void
ru_ru: Создайте метод, возвращающий void

# CreateMethodReturnIntAchievementName
source: Return int
ru_ru: Вернуть int

# CreateMethodReturnIntAchievementDescription
source: Create a method that returns an int
ru_ru: Создайте метод, возвращающий int

# CreateMethodReturnStringAchievementName
source: Return a string
ru_ru: Вернуть string

# CreateMethodReturnStringAchievementDescription
source: Create a method that returns a string
ru_ru: Создайте метод, возвращающий string

# CreateMethodReturnBoolAchievementName
source: Return a bool
ru_ru: Вернуть bool

# CreateMethodReturnBoolAchievementDescription
source: Create a method that returns a boolean
ru_ru: Создайте метод, возвращающий boolean

# CreateMethodReturnCharAchievementName
source: Return char
ru_ru: Вернуть char

# CreateMethodReturnCharAchievementDescription
source: Create a method that returns a char
ru_ru: Создайте метод, возвращающий char

# CreateMethodReturnDoubleAchievementName
source: Return double
ru_ru: Вернуть double

# CreateMethodReturnDoubleAchievementDescription
source: Create a method that returns a double
ru_ru: Создайте метод, возвращающий double

# CreateMethodReturnFloatAchievementName
source: Return float
ru_ru: Вернуть float

# CreateMethodReturnFloatAchievementDescription
source: Create a method that returns a float
ru_ru: Создайте метод, возвращающий float

# JaggedArrayAchievementName
source: JAG
ru_ru: Пила

# JaggedArrayAchievementDescription
source: Declare a jagged multidimensional array ([][] instead of [,])
ru_ru: Объявите вложенный многомерный массив ([][] вместо [,])

# DeclareIntName
source: Declare an int
ru_ru: Объявление переменной типа int

# DeclareIntDescription
source: Declare, but do not initialize, an int in one statement
ru_ru: Одним оператором объявите, но не инициализируйте переменную типа int

# DeclareInitializeIntName
source: Declare and initialize an int
ru_ru: Объявление и инициализация переменной типа int

# DeclareInitializeIntDescription
source: Declare and initialize an int in one statement
ru_ru: Одним оператором объявите и проинициализируйте переменную типа int

# MultipleDeclareFloatName
source: Declare multiple floats in one statement
ru_ru: Объявление нескольких переменных типа float в одном операторе

# MultipleDeclareFloatDescription
source: Declare multiple floats in one go
ru_ru: Объявите несколько переменных типа float за раз

# DeclareInitializeFloatName
source: Declare and initialize float
ru_ru: Объявление и инициализация переменной типа float

# DeclareInitializeFloatDescription
source: Declare and initialize a float in one statement
ru_ru: Объявите и проинициализируйте float одним оператором

# MultipleDeclareDoubleName
source: Declare multiple doubles in one statement
ru_ru: Объявление нескольких переменных типа double в одном операторе

# MultipleDeclareDoubleDescription
source: Declare multiple doubles in one go
ru_ru: Объявите несколько переменных типа double за раз

# PrintToConsoleAchievementName
source: Ghost in the Shell
ru_ru: Призрак в доспехах

# PrintToConsoleAchievementDescription
source: Print something to the console
ru_ru: Выведите что-нибудь на консоль

# ForEachWithEnumAchievementName
source: Enumerate an enumeration
ru_ru: Перебор перечисления

# ForEachWithEnumAchievementDescription
source: Use a foreach loop to enumerate over all elements of ...an enumeration.
ru_ru: Используйте цикл foreach чтобы пройтись по всем элементам перечисления

# PrintNewLineAchievementName
source: Print a newline using \n
ru_ru: Вывод новой строки с помощью символа \n

# PrintNewLineAchievementDescription
source: Print a newline to the console using \n
ru_ru: Выведите новую строку на консоль с помощью символa \n

# PrintHorizontalTabAchievementName
source: Print a tab using \t
ru_ru: Вывод табуляции с помощью символа \t

# PrintHorizontalTabAchievementDescription
source: Print a horizontal tab to the console using \t
ru_ru: Выведите горизонтальную табуляцию на консоль с помощью символа \t

# PrintQuoteCharAchievementName
source: Print a " using \"
ru_ru: Вывод символа " используя escape-последовательность \"

# PrintQuoteCharAchievementDescription
source: Print a quote (") to the console using \"
ru_ru: Выведите двойную кавычку (") на консоль используя escape-последовательность \"

# PrintSingleQuoteCharAchievementName
source: Print a ' using \'
ru_ru: Вывод символа ' используя escape-последовательность \'

# PrintSingleQuoteCharAchievementDescription
source: Print a quote (') to the console using \'
ru_ru: Выведите кавычку (') на консоль используя escape-последовательность \'

# PrintBackSlashCharAchievementName
source: Print a \ using \\
ru_ru: Вывод символа \ используя escape-последовательность \\

# PrintBackSlashCharAchievementDescription
source: Print a backslash (\) to the console using \\
ru_ru: Выведите обратный слеш (\) на консоль используя escape-последовательность \\

# BeastNumberAchievementName
source: The number of the beast...
ru_ru: Число зверя...

# BeastNumberAchievementDescription
source: Assign a value of 666 to an integer
ru_ru: Назначьте целой переменной значение 666

# TryCatchIgnoreStatementAchievementName
source: Try-Catch-Ignore
ru_ru: Try-Catch-Заигнорь

# TryCatchIgnoreStatementAchievementDescription
source: Write an empty catch statement
ru_ru: Напишите пустой блок catch

# CalculatorChallengeName
source: Calculator
ru_ru: Калькулятор

# CalculatorChallengeDescription
source: Implement the ICalculator interface
ru_ru: Реализуйте интерфейс ICalculator

# TypeOfAchievementDescription
source: Use typeof keyword
ru_ru: Используйте оператор typeof

# AssignIntName
source: Assign an integer value
ru_ru: Присвоение целого

# AssignIntDescription
source: Assign a value to an existing integer variable
ru_ru: Присвойте значение существующей целой переменной

# IfShorthandAchievementDescription
source: Write a conditional expression
ru_ru: Напишите условное выражение

# NestedIfStatementAchievementName
source: If-in-if
ru_ru: If-в-if

# NestedIfStatementAchievementDescription
source: Write an if statement inside another if
ru_ru: Напишите оператор if внутри другого if

# AssignCharName
source: Assign a char value
ru_ru: Присвоение символа

# AssignCharDescription
source: Assign a value to an existing char variable
ru_ru: Присвойте значение существующей символьной переменной

# ParamsParameterAchievementName
source: Params Parameter
ru_ru: Ключевое слово params

# ParamsParameterAchievementDescription
source: Write a method that uses the params keyword in its arguments
ru_ru: Напишите метод, использующий в своих аргументах ключевое слово params

# ConvertToCharAchievementName
source: Convert to Char
ru_ru: Преобразование к Char

# ConvertToCharAchievementDescription
source: Use the Convert.ToChar method
ru_ru: Используйте метод Convert.ToChar

# ConvertToDecimalAchievementName
source: Convert to Decimal
ru_ru: Преобразование к Decimal

# ConvertToDecimalAchievementDescription
source: Use the Convert.ToDecimal method
ru_ru: Используйте метод Convert.ToDecimal

# ConvertToDoubleAchievementName
source: Convert to double
ru_ru: Преобразование к double

# ConvertToDoubleAchievementDescription
source: Use the Convert.ToDouble method
ru_ru: Используйте метод Convert.ToDouble method

# ConvertToInt32AchievementName
source: Convert to Int32
ru_ru: Преобразование к Int32

# ConvertToInt32AchievementDescription
source: Use the Convert.ToInt32 method
ru_ru: Используйте метод Convert.ToInt32 method

# TooManyDimensionArrayDeclarationAchievementName
source: Solving string theory?
ru_ru: Доказываешь теорию струн?

# TooManyDimensionArrayDeclarationAchievementDescription
source: You've declared an array with more than 11 dimensions
ru_ru: Объявите массив с более чем 11 измерениями

# CreateClassAchievementName
source: Classy!
ru_ru: Классно!

# CreateClassAchievementDescription
source: Create a class
ru_ru: Создайте класс

# CreateOverloadedConstructorAchievementName
source: Bob the Overloaded Constructor
ru_ru: Боб, перегруженный конструктор

# CreateOverloadedConstructorAchievementDescription
source: Write a overloaded class constructor
ru_ru: Напишите перегруженный конструктор класса

# DeclareDoubleName
source: Declare a double
ru_ru: Объявление переменной типа double

# DeclareDoubleDescription
source: Declare, but do not initialize, a double in one statement
ru_ru: Одним оператором объявите, но не инициализируйте переменную типа double

# OperatorOrAchievementName
source: Use OR (||) operator
ru_ru: Использование оператора ИЛИ (||)

# OperatorOrAchievementDescription
source: Make use of the OR operator
ru_ru: Используйте оператор ИЛИ

# CreatePropertyAchievementName
source: Create a property
ru_ru: Создание свойства

# CreatePropertyAchievementDescription
source: Write a property of any type
ru_ru: Создайте свойство любого типа

# FormatSpecifierAchievementName
source: Format Specifier
ru_ru: Строка-спецификатор формата

# FormatSpecifierAchievementDescription
source: Print something to the console using a format specifier
ru_ru: Выведите что-либо на консоль с использованием спецификатора формата

# CreateThisConstructorInitAchievementName
source: Dis a constructor
ru_ru: Це конструктор

# CreateThisConstructorInitAchievementDescription
source: Call another constructor using the this keyword from a constructor
ru_ru: Вызовите из конструктора другой конструктор с помощью ключевого слова this

# DeclareInitArrayAchievementName
source: Declare and initialize an array with an initializer list
ru_ru: Объявление и инициализация массива с помощью списка инициализации

# DeclareInitArrayAchievementDescription
source: Declare and initialize an array with an initializer list
ru_ru: Объявите и инициализируйте массив с помощью списка инициализации

# InlineCommentAchievementName
source: Inline Commentary
ru_ru: Встроенный комментарий

# InlineCommentAchievementDescription
source: Write an inline comment
ru_ru: Напишите однострочный комментарий

# DeclareFloatName
source: Declare a float
ru_ru: Объявление переменной типа float

# DeclareFloatDescription
source: Declare, but do not initialize, a float in one statement
ru_ru: В одном операторе объявите, но не инициализируйте переменную типа float

# DeclareHexShorthandCharAchievementName
source: I talk in hex
ru_ru: Я думаю в хексе

# DeclareHexShorthandCharAchievementDescription
source: Use hexadecimal shorthand to create a char
ru_ru: Используйте шестнадцатеричную запись для создания символьной переменной

# DestructorAchievementName
source: My name is Destructor!
ru_ru: Мое имя - Деструктор!

# DestructorAchievementDescription
source: Define a destructor for your class
ru_ru: Определите в своем классе деструктор

# OverrideToStringAchievementDescription
source: Override System.Object.ToString() method
ru_ru: Переопределите метод System.Object.ToString()

# WhileLoopAchievementName
source: While loop
ru_ru: Цикл While

# WhileLoopAchievementDescription
source: Use a while loop
ru_ru: Используйте цикл while

# AssignDoubleName
source: Assign a double value
ru_ru: Присвоение значения типа double

# AssignDoubleDescription
source: Assign a value to an existing double variable
ru_ru: Присвойте значение существующей переменной типа double

# DefaultCaseInSwitchSwitchAchievementName
source: Define a default switch case
ru_ru: Определение в операторе switch раздела по-умолчанию

# DefaultCaseInSwitchSwitchAchievementDescription
source: Create a default case in a switch statement
ru_ru: Определите раздел по-умолчанию в операторе switch

# DeclareEscapeCharAchievementName
source: Escape char
ru_ru: Символ escape-последовательность

# DeclareEscapeCharAchievementDescription
source: Declare an escape character char
ru_ru: Объявите символ, содержащий escape-последовательность

# OutParameterAchievementName
source: Out Parameter
ru_ru: Ключевое слово out

# OutParameterAchievementDescription
source: Write a method that uses the out keyword in its arguments
ru_ru: Напишите метод, использующий в своих аргументах ключевое слово out

# ExtensionMethodAchievementName
source: Extended!
ru_ru: Расширено!

# ExtensionMethodAchievementDescription
source: Create an extension method
ru_ru: Создайте метод-расширение

# CreateDefaultConstructorAchievementName
source: Explicit default
ru_ru: Явное умолчание

# CreateDefaultConstructorAchievementDescription
source: Write a default class constructor
ru_ru: Напишите конструктор класса по-умолчанию

# AssignFloatName
source: Assign a float value
ru_ru: Присвоение значения типа float

# AssignFloatDescription
source: Assign a value to an existing float variable
ru_ru: Присвойте значение в существующую переменную типа float

# OperatorAndAchievementName
source: Use AND (&&) operator
ru_ru: Использование оператора И (&&)

# OperatorAndAchievementDescription
source: Make use of the AND operator
ru_ru: Используйте оператор И

# GotoAchievementName
source: Spaghetti Bolognese
ru_ru: Спагетти Болоньезе

# GotoAchievementDescription
source: Please don't use goto anymore. You've got the achievement, happy now?
ru_ru: Пожалуйста, больше не используйте goto. Вы же заработали достижение, теперь довольны?

# NotOperatorAchievementName
source: Invert!
ru_ru: Инверсия!

# NotOperatorAchievementDescription
source: Use a not operator to invert an expression
ru_ru: Используйте оператор НЕ (!) для инверсирования значения выражения

# StringCompareAchievementName
source: String comparing
ru_ru: Посравниваем строчки

# StringCompareAchievementDescription
source: Use the String.Compare method
ru_ru: Используйте метод String.Compare

# StringConcatAchievementName
source: String concaten-what?
ru_ru: Строковая конка-чего?

# StringConcatAchievementDescription
source: Use the String.Concat method
ru_ru: Используйте метод String.Concat

# StringCopyAchievementName
source: String copying
ru_ru: Копирование строк

# StringCopyAchievementDescription
source: Use the String.Copy method
ru_ru: Используйте метод String.Copy

# StringEqualsAchievementName
source: String equals
ru_ru: Равенство строк

# StringEqualsAchievementDescription
source: Use the String.Equals method
ru_ru: Используйте метод String.Equals

# StringJoinAchievementName
source: String joining
ru_ru: Объединение строк

# StringJoinAchievementDescription
source: Use the String.Join method
ru_ru: Используйте метод String.Join

# OverloadOperatorAchievementName
source: Operator overload
ru_ru: Оператор перегружен!

# OverloadOperatorAchievementDescription
source: Overload an operator
ru_ru: Перегрузите оператора

# PlusPlusOperatorAchievementName
source: Use the ++ operator
ru_ru: Использование оператора ++

# PlusPlusOperatorAchievementDescription
source: Write an expression that uses the ++ operator
ru_ru: Напишите выражение, использующее оператор ++

# MinusMinusOperatorAchievementName
source: Use the -- operator
ru_ru: Использование оператора --

# MinusMinusOperatorAchievementDescription
source: Write an expression that uses the -- operator
ru_ru: Напишите выражение, использующее оператор --

# EnumInitializerExplicitAchievementName
source: I'll tell you how to count
ru_ru: Я научу тебя считать

# EnumInitializerExplicitAchievementDescription
source: Create an enum with explicit value(s)
ru_ru: Создайте перечисление с явно указанными значениями

# PlusOperatorAchievementName
source: Use the + operator
ru_ru: Использование оператора +

# PlusOperatorAchievementDescription
source: Write an expression that uses the + operator
ru_ru: Напишите выражение, использующее оператор +

# MinusOperatorAchievementName
source: Use the - operator
ru_ru: Использование оператора -

# MinusOperatorAchievementDescription
source: Write an expression that uses the - operator
ru_ru: Напишите выражение, использующее оператор -

# MultiplyOperatorAchievementName
source: Use the * operator
ru_ru: Использование оператора *

# MultiplyOperatorAchievementDescription
source: Write an expression that uses the * operator
ru_ru: Напишите выражение, использующее оператор *

# DivideOperatorAchievementName
source: Use the / operator
ru_ru: Использование оператора /

# DivideOperatorAchievementDescription
source: Write an expression that uses the / operator
ru_ru: Напишите выражение, использующее оператор /

# ModuloOperatorAchievementName
source: Use the modulo operator
ru_ru: Использование оператора %

# ModuloOperatorAchievementDescription
source: Write an expression that uses the % operator
ru_ru: Напишите выражение, использующее оператор %

# DeclareArrayAchievementName
source: Declare an array
ru_ru: Объявление массива

# DeclareArrayAchievementDescription
source: Declare an array
ru_ru: Объявите массив

# CreateStaticMethodAchievementName
source: Create a static method
ru_ru: Создание статического метода

# CreateStaticMethodAchievementDescription
source: Create a static method
ru_ru: Создайте статический метод

# CatchManyExceptionsAchievementName
source: Sir Catch-a-lot
ru_ru: Сэр-поймай-всё

# CatchManyExceptionsAchievementDescription
source: Catch more than 5 exception explicitely
ru_ru: Явно поймайте 5 или более исключений

# CreateConstructorAchievementName
source: Bob the Constructor
ru_ru: Боб, конструктор

# CreateConstructorAchievementDescription
source: Write a class constructor
ru_ru: Напишите конструктор класса

# CreateInterfaceAchievementName
source: Interface
ru_ru: Интерфейс

# CreateInterfaceAchievementDescription
source: Create an interface
ru_ru: Создайте интерфейс

# UseAsKeywordAchievementDescription
source: Try explicit cast with AS keyword
ru_ru: Напишите явное преобразование типа с использованием ключевого слова AS

# ProgramWithStartupParamsAchievementName
source: Write a program that accepts and uses parameters to startup
ru_ru: Параметры запуска

# ProgramWithStartupParamsAchievementDescription
source: Write a program that accepts and uses parameters to startup
ru_ru: Напишите программу, принимающую и использующую параметры запуска

# PrivateSetterAchievementName
source: Private Setter
ru_ru: Приватный сеттер

# PrivateSetterAchievementDescription
source: Write a property of any type with a private setter
ru_ru: Создайте свойство с приватным сеттером

# EnumInitializerAchievementName
source: Create enumeration
ru_ru: Создание перечисления

# EnumInitializerAchievementDescription
source: Create an enum type.
ru_ru: Создайте тип-перечисление

# IfElseStatementAchievementName
source: Or else what?!
ru_ru: И что тогда?!

# IfElseStatementAchievementDescription
source: Make use of an if/else statement
ru_ru: Используйте оператор if/else

# EnumSwitchAchievementDescription
source: Switch over an enum
ru_ru: Используйте оператор switch по всем значениям какого-либо перечисления

# UpperBoundaryValueFDoubleName
source: Living on the double edge
ru_ru: Жизнь на двойной грани

# UpperBoundaryValueFDoubleDescription
source: Assign the maximal allowed value to a double (beware the overflow!)
ru_ru: Присвойте максимальное допустимое значение переменной типа double (бойтесь переполнения!)

# LowerBoundaryValuedoubleName
source: Living on the negative double edge
ru_ru: Жизнь на отрицательной двойной грани

# LowerBoundaryValuedoubleDescription
source: Assign the minimal allowed value to a double (beware the overflow!)
ru_ru: Присвойте минимальное допустимое значение переменной типа double (бойтесь переполнения!)

# DeclareCharName
source: Declare a char
ru_ru: Объявите переменную типа char

# DeclareCharDescription
source: Declare, but do not initialize, a char in one statement
ru_ru: Одним оператором объявите, но не инициализируйте переменную типа char

# JobSecurityAchievementName
source: Job Security
ru_ru: Гарантия занятости

# JobSecurityAchievementDescription
source: Written a LINQ query with over 10 lines of code
ru_ru: Напишите LINQ-запрос, длиной более 10 строк

# TellingAStoryAchievementName
source: Telling a story
ru_ru: Расскажи мне историю

# TellingAStoryAchievementDescription
source: Created a method longer than 100 lines
ru_ru: Создайте метод длиной более 100 строк

# EpicTaleAchievementName
source: Epic Tale
ru_ru: Эпичная история

# EpicTaleAchievementDescription
source: Created a method longer than 300 lines
ru_ru: Создайте метод длиной более 300 строк

# ParametizerAchievementName
source: The Parametizer
ru_ru: Параметризатор

# ParametizerAchievementDescription
source: Created a method with more than 10 non optional parameters
ru_ru: Создайте метод с более чем десятью обязательными параметрами

# GUTAchievementName
source: Grand Unified Theory
ru_ru: Теория великого объединения

# GUTAchievementDescription
source: Design a class that implements at least 5 interfaces
ru_ru: Спроектируйте класс, реализующий как минимум 5 интерфейсов

# EveryOptionEnumAchievementName
source: Every Option Considered
ru_ru: Подумал о каждой мелочи

# EveryOptionEnumAchievementDescription
source: Created an enum with more than 10 values
ru_ru: Создайте перечисление с более чем 10 значениями

# ProceduralProgrammerAchievementName
source: Procedural Programmer
ru_ru: Процедурный программист

# ProceduralProgrammerAchievementDescription
source: Created a method with more than 10 out parameters
ru_ru: Создайте метод с более чем 10 out-параметрами
